package second_semester.socialNetwork.entities;

import java.util.ArrayList;
import java.util.Random;

public class ContentGenerator {

    private final int personsCount;
    private final Random r = new Random();
    private final Network network = Network.getNetwork();


    public ContentGenerator(int personsCount) {
        this.personsCount = personsCount;
        stepOneGenPersons();
    }


    private void stepOneGenPersons(){
        String[] mNames = {"Августин", "Авраам","Аристарх", "Аркадий", "Арсен", "Арсений", "Артем", "Артемий", "Артур", "Архип",            "Болеслав", "Борис", "Борислав", "Бронислав", "Бронислава", "Булат", "Вадим", "Валентин", "Валентина",            "Валерий", "Викентий", "Виктор", "Бенедикт", "Виталий", "Влад", "Владимир", "Владислав", "Владлен",            "Вольдемар", "Всеволод", "Вячеслав", "Евгений", "Евдоким", "Ефим", "Ефрем", "Даниил", "Демьян", "Денис",            "Джеймс", "Джек",  "Дмитрий", "Добрыня",  "Игнатий", "Игорь", "Иннокентий", "Иосиф", "Касьян", "Ким","Кир", "Клим", "Климент", "Кондрат", "Константин", "Лев", "Леон", "Леонид", "Леонтий", "Макар", "Максим","Марат", "Дмитрий","Михаил","Альберт","Сергей","Афонасий","Петр","Зиновий","Павел","Карл","Максим","Альфред","Александр","Валерий","Вячеслав","Константин","Анатолий","Егор","Кащей","Иван","Добрыня","Никита"};
        String[] mMid = {"Августинович","Авраамович","Аристархович","Аркадийович","Арсенович","Арсенийович","Артемович","Артемийович","Артурович","Архипович",            "Болеславович","Борисович","Бориславович","Брониславович","Брониславаович","Булатович","Вадимович","Валентинович","Валентинаович",            "Валерийович","Викентийович","Викторович","Бенедиктович","Виталийович","Владович","Владимирович","Владиславович","Владленович",            "Вольдемарович","Всеволодович","Вячеславович","Евгенийович","Евдокимович","Ефимович","Ефремович","Даниилович","Демьянович","Денисович","Джеймсович","Джекович",  "Дмитрийович","Добрыняович",  "Игнатийович","Игорьович","Иннокентийович","Иосифович","Касьянович","Кимович","Кирович","Климович","Климентович","Кондратович","Константинович","Левович","Леонович","Леонидович","Леонтийович","Макарович","Максимович","Маратович","Дмитрийович","Михаилович","Альбертович","Сергейович","Афонасийович","Петрович","Зиновийович","Павелович","Карлович","Максимович","Альфредович", "Александрович","Валерийович","Вячеславович","Константинович","Анатолийович","Егорович","Кащейович","Иванович","Добрыняович","Никита"};
        String[] mLast = {"Смирнов","Иванов","Кузнецов","Соколов","Попов","Лебедев","Козлов","Новиков","Морозов","Петров","Волков","Соловьёв","Васильев",            "Зайцев","Павлов","Семёнов","Голубев","Виноградов","Богданов","Воробьёв","Фёдоров","Михайлов",            "Беляев","Тарасов","Белов","Комаров","Орлов","Киселёв","Макаров","Андреев","Ковалёв","Ильин",            "Гусев","Титов","Кузьмин","Кудрявцев","Баранов","Куликов","Алексеев","Степанов","Яковлев","Сорокин",            "Сергеев","Романов","Захаров","Борисов","Королёв","Герасимов","Пономарёв","Григорьев","Лазарев",            "Медведев","Ершов","Никитин","Соболев","Рябов","Поляков","Цветков","Данилов","Жуков","Фролов",            "Журавлёв","Николаев","Крылов","Максимов","Сидоров","Осипов","Белоусов","Федотов","Дорофеев",            "Егоров","Матвеев","Бобров","Дмитриев","Калинин","Анисимов","Петухов","Антонов","Тимофеев",            "Никифоров","Веселов","Филиппов","Марков","Большаков","Суханов","Миронов","Ширяев","Александров",            "Коновалов","Шестаков","Казаков","Ефимов","Денисов","Громов","Фомин","Давыдов","Мельников",            "Щербаков","Блинов","Колесников","Карпов","Афанасьев","Власов","Маслов","Исаков","Тихонов",            "Аксёнов","Гаврилов","Родионов","Котов","Горбунов","Кудряшов","Быков","Зуев"};
        String[] fNames = {"Аврора", "Агата", "Агафон", "Агнесса", "Агния", "Ада", "Аделаида", "Аделина", "Акайо", "Акулина", "Алан",            "Алевтина", "Александр", "Александра", "Алена", "Алина", "Алиса", "Алла", "Алсу", "Альберт", "Альбина",            "Альфия", "Амалия", "Амелия", "Анастасия", "Ангелина", "Андрей", "Анжела", "Анжелика", "Анисий", "Анна",            "Антонина", "Анфиса", "Аполлинарий", "Ариадна", "Арина", "Ася", "Белла", "Берта", "Богдан", "Божена",            "Валерия", "Ванда", "Варвара", "Василий", "Василиса", "Венера", "Вера", "Вероника",  "Виктория", "Виолетта",            "Елена","Светлана","Роза","Людмила","Мария","Кристина","Фекла","Александра","Наталья","Татьяна","Соня",            "Екатерина","Ангелина","Любава","Прокофья","Валерьяна","Сара","Джессика","Авдотья","Агафья","Роза"};
        String[] fMid = {"Авроровна","Агатовна","Агафоновна","Агнессовна","Агниовна","Адовна","Аделаидовна","Аделиновна","Акайо","Акулиновна","Алан",            "Алевтиновна","Александр","Александровна","Аленовна","Алиновна","Алисовна","Алловна","Алсу","Альберт","Альбиновна",            "Альфиовна","Амалиовна","Амелиовна","Анастасиовна","Ангелиновна","Андрей","Анжеловна","Анжеликовна","Анисий","Анновна",            "Антониновна","Анфисовна","Аполлинарий","Ариадновна","Ариновна","Асовна","Белловна","Бертовна","Богдан","Боженовна",            "Валериовна","Вандовна","Варваровна","Василий","Василисовна","Венеровна","Веровна","Верониковна",  "Викториовна","Виолеттовна",            "Еленовна","Светлановна","Розовна","Людмиловна","Мариовна","Кристиновна","Фекловна","Александровна","Натальовна","Татьяновна","Соновна",            "Екатериновна","Ангелиновна","Любавовна","Прокофьовна","Валерьяновна","Саровна","Джессиковна","Авдотьовна","Агафьовна"};
        String[] fLast = {"Смирновa","Ивановa","Кузнецовa","Соколовa","Поповa","Лебедевa","Козловa","Новиковa","Морозовa","Петровa","Волковa","Соловьёвa","Васильевa",            "Зайцевa","Павловa","Семёновa","Голубевa","Виноградовa","Богдановa","Воробьёвa","Фёдоровa","Михайловa",            "Беляевa","Тарасовa","Беловa","Комаровa","Орловa","Киселёвa","Макаровa","Андреевa","Ковалёвa","Ильинa",            "Гусевa","Титовa","Кузьминa","Кудрявцевa","Барановa","Куликовa","Алексеевa","Степановa","Яковлевa","Сорокинa",            "Сергеевa","Романовa","Захаровa","Борисовa","Королёвa","Герасимовa","Пономарёвa","Григорьевa","Лазаревa",            "Медведевa","Ершовa","Никитинa","Соболевa","Рябовa","Поляковa","Цветковa","Даниловa","Жуковa","Фроловa",            "Журавлёвa","Николаевa","Крыловa","Максимовa","Сидоровa","Осиповa","Белоусовa","Федотовa","Дорофеевa", "Егоровa","Матвеевa","Бобровa","Дмитриевa","Калининa","Анисимовa","Петуховa","Антоновa","Тимофеевa",            "Никифоровa","Веселовa","Филипповa","Марковa","Большаковa","Сухановa","Мироновa","Ширяевa","Александровa",            "Коноваловa","Шестаковa","Казаковa","Ефимовa","Денисовa","Громовa","Фоминa","Давыдовa","Мельниковa",            "Щербаковa","Блиновa","Колесниковa","Карповa","Афанасьевa","Власовa","Масловa","Исаковa","Тихоновa",            "Аксёновa","Гавриловa","Родионовa","Котовa","Горбуновa","Кудряшовa"};
        String[] cityName = {"Екатеринбург ","Смоленск ","Нижний новогород ","Москва ","Петропавловск ","Алушта ","Сочи ","Челябинск ","Краснодар ","Рыбинск ","Калининград ",            "Днепропетровск ","Кыштым ","Нью-Йорк ","Лос Анжелес ","Зигуевка ","Питер ","Владивосток ","Владимир ","Волгоград ","Знаменка "};


        Person person;
        Account account;

        for (int i = 0; i < personsCount; i++) {
            person = new Person();

                // сгенерировать "человека"
                if (r.nextInt(4) + 1 > 2) {
                    person.setFirstName(fNames[r.nextInt(fNames.length)]);
                    person.setMidName(fMid[r.nextInt(fMid.length)]);
                    person.setLastName(fLast[r.nextInt(fLast.length)]);
                    person.setAge(r.nextInt(80)+5);
                    person.setSex("Женский");
                } else {
                    person.setFirstName(mNames[r.nextInt(mNames.length)]);
                    person.setMidName(mMid[r.nextInt(mMid.length)]);
                    person.setLastName(mLast[r.nextInt(mLast.length)]);
                    person.setAge(r.nextInt(80)+5);
                    person.setSex("Мужской");
                }

            person.seteMail( genMail() );
            person.setPhoneNumber( genPhoneNum() );
            person.setCity(cityName[r.nextInt(cityName.length)]);
            account = new Account(person);
            network.regAccount(account);
         }

        System.out.println("Добавлено " + personsCount + " пользователей");
        stepTwoFillingOutMessages();
    }

    private String genMail(){
        String mailChars = "qwertyuiopasdfghjkl.zxcvbnm.";

        StringBuilder mail= new StringBuilder();
        int mailCharCount = r.nextInt(10)+6;
        for (int j = 0; j < mailCharCount; j++) {
            mail.append(mailChars.charAt(r.nextInt(mailChars.length() - 1)));
            if (mail.length() == 5) {
                mail.append("@");
            }
        }

        return mail.toString();
    }

    private String genPhoneNum(){
        StringBuilder phoneNumber = new StringBuilder("+");
        for (int j = 0; j < 11; j++) {
            phoneNumber.append(r.nextInt(9));

            if (phoneNumber.length() == 2) {
                phoneNumber.append("(");
            }

            if (phoneNumber.length() == 6) {
                phoneNumber.append(")");
            }
        }

        return phoneNumber.toString();
    }


    private void stepTwoFillingOutMessages(){
        String[] messageContent = {"Сидя", "на", "склоне", "зеленого", "поросшего", "травой", "и", "редким", "кустарником", "холма", "Нари", "наблюдал", "за", "облаками", "медленно", "надвигающимися",
                "на", "поселок", "со", "стороны", "гор", "далеко", "на", "западе", "Сегодня", "был", "один", "из", "тех", "редких", "дней", "когда", "не", "надо", "было", "пасти", "хлопотать", "по", "хозяйству", "или", "учиться", "у", "отца", "кузнечному", "делу", "Сегодня", "он", "мог", "просто", "насладиться", "жизнью", "так", "как", "это делали", "все", "остальные", "дети", "в", "поселке", "Те", "", "кто", "мог", "в", "полной", "мере", "быть", "ребенком", "а", "не", "довольствоваться", "жалкими", "днями", "вырванными", "из", "серой", "рутины", "обязанностей", "и", "дел", "навалившихся", "с", "раннего", "детства", "Он", "вновь", "попытался", "вспомнить", "лицо", "матери", "Она", "умерла", "всего", "несколько", "лет", "назад", "и", "он", "ненавидел", "себя", "за", "то", "что", "черты", "ее", "лица", "ускользали", "из", "памяти", "все", "больше", "и", "больше", "Помотав", "головой", "и", "отогнав", "наползающие", "грустные", "мысли", "он", "заставил", "себя", "подняться", "и", "отряхнувшись", "неторопливо", "стал", "спускаться", "к", "подножию", "холма", "где", "находился", "его", "родной", "поселок", "Голод", "все", "сильнее", "начинал", "жечь", "желудок", "принося", "ощущение", "легкой", "тошноты", "и", "беспокойства", "Ему", "хотелось", "по", "скорее", "отдать", "весь", "улов", "отцу", "что", "бы", "тот", "сварил", "свою", "знаменитую", "уху", "повторить", "которую", "Нари", "ни", "как", "не", "удавалось", "хоть", "он", "и", "старался", "делать", "все", "в", "точности", "как", "он", "Нари", "был", "единственным", "ребенком", "в", "семье", "живя", "с", "приемными", "родителями", "о", "чем", "сам", "даже", "не", "догадывался", "Он", "остался", "один", "в", "возрасте", "пяти", "месяцев", "Его", "настоящие", "родители", "пропали", "во", "время", "поездки", "в", "городок", "находящийся", "всего", "в", "десяти", "километрах", "от", "поселка", "В", "тот", "роковой", "день", "ничего", "с", "виду", "не", "предвещавшие", "легкие", "облака", "на", "горизонте", "стали", "быстро", "заволакивать", "все", "небо", "превратившись", "в", "мрачные", "серые", "тучи", "а", "вскоре", "началась", "такая", "чудовищная", "гроза", "какой", "невидовали", "в", "этих", "краях", "уже", "очень", "много", "лет", "Молнии", "сверкали", "одна", "за", "одной", "а", "ветер", "достигал", "такой", "силы", "что", "срывал", "крыши", "с", "домов", "словно", "то", "были", "аккуратно", "уложенные", "бумажные", "листы", "Люди", "попрятались", "по", "своим", "домам", "и", "подвалам", "усердно", "молясь", "о", "помощи", "свыше", "но", "боги", "в", "тот", "день", "услышали", "далеко", "не", "всех", "После", "того", "как", "все", "стихло", "глазам", "людей", "предстала", "ужасная", "картина:", "многие", "деревья", "были", "поломаны", "вырваны", "с", "корнем", "больше", "половины", "домов", "лишилась", "крыш", "а", "некоторые", "из", "них", "и", "вовсе", "были", "полностью", "разрушены", "Арис", "", "родной", "брат", "отца", "мальчика", "и", "его", "жена", "Кари", "присматривающие", "за", "малышом", "в", "тот", "роковой", "день", "сами", "лишились", "большой", "части", "крыши", "дома", "и", "части", "сарая", "со", "скотом", "хотя", "сами", "животные", "не", "смотря", "на", "это", "чудом", "остались", "целы", "Когда", "настоящие", "родители", "Нари", "не", "вернулись", "ни", "в", "этот", "ни", "на", "следующий", "ни", "на", "утро", "третьего", "дня", "Арис", "и", "Кари", "забили", "тревогу", "В", "надежде", "найти", "своего", "брата", "и", "его", "жену", "Арис", "отправился", "по", "единственной", "дороге", "ведущей", "к", "городу", "по", "направлению", "к", "которому", "те", "уехали", "тремя", "днями", "ранее", "Дорога", "была", "в", "ужасном", "состоянии", "На", "ней", "то", "тут", "то", "там", "лежали", "перегораживая", "проезд", "огромные", "ветви", "деревьев", "а", "сама", "она", "превратилась", "в", "труднопроходимую", "грязь", "скользкую", "достигавшую", "в", "некоторых", "местах", "глубины", "в", "десяток", "с", "лишним", "сантиметров", "Страхи", "Ариса", "многократно", "усилились", "когда", "у", "обочины", "под", "поломанным", "обгоревшим", "деревом", "он", "нашел", "вещи", "принадлежавшие", "жене", "брата", "а", "спустя", "всего", "пару", "минут", "в", "том", "же", "месте", "обнаружил", "амулет", "который", "тот", "всегда", "носил", "при", "себе", "Это", "был", "небольшой", "кусок", "янтаря", "на", "черной", "прочной", "веревочке", "Еще", "в", "детстве", "они", "с", "братом", "выбрали", "два", "одинаковых", "камня", "и", "носили", "на", "шее", "в", "знак", "родства", "братства", "и", "нерушимой", "дружбы", "Теперь", "камень", "висел", "на", "обломанной", "ветви", "в", "полуметре", "от", "земли", "вместе", "с", "большим", "лоскутом", "ткани", "оторванной", "без", "сомнения", "от", "рубахи", "его", "брата", "Все", "знали", "что", "в", "этих", "местах", "водились", "волки", "медведи", "и", "другие", "крупные", "хищники", "но", "если", "бы", "это", "было", "нападение", "животных", "или", "людей", "то", "должны", "были", "бы", "остаться", "хоть", "какието", "следы", "но", "кроме", "вещей", "амулета", "и", "лоскута", "ткани", "на", "дереве", "", "ничего", "найдено", "не", "было", "Родители", "Нари", "словно", "испарились", "Именно", "тогда", "Арис", "понял", "что", "его", "брат", "уже", "вряд", "ли", "вернется", "домой", "Вместе", "с", "Кари", "они", "взяли", "малыша", "себе", "начав", "заботится", "о", "нем", "так", "", "как", "заботились", "бы", "о", "своем", "собственном", "И", "дали", "другдругу", "слово:", "никогда", "не", "говорить", "мальчику", "о", "том", "что", "случилось", "с", "его", "настоящими", "родителями" };

        String idSender, idReciever;
        ArrayList<String> accountsId = network.getIdList();
        Chat chatSender, chatReceiver;
        StringBuilder messageStr;
        Message message;
        Account accountSender, accountReciever;

        int chatCount = r.nextInt(personsCount*10 )+50;
        for (int i = 0; i <  chatCount; i++) {

            idReciever = accountsId.get(r.nextInt(accountsId.size()-1));
            idSender = accountsId.get(r.nextInt(accountsId.size()-1));
            if (idReciever.equals(idSender)) {continue;}

            accountSender = network.getAccountById(idSender);
            accountReciever = network.getAccountById(idReciever);

            chatSender = accountSender.getChat(idReciever);
            chatReceiver = accountReciever.getChat(idSender);

            int messageCount = r.nextInt(100)+1;
            for (int x = 0; x < messageCount; x++) {

                if( x > 40) {
                    if (!accountReciever.isBlocked(idSender)) {
                        accountReciever.addInBlockList(idSender);
                    }
                }

                messageStr = new StringBuilder();

                int messageLen = r.nextInt(40)+1;
                for (int j = 0; j < messageLen; j++) {
                    messageStr.append(messageContent[r.nextInt(messageContent.length - 1) + 1]).append(" ");
                }

                if ( r.nextInt(100) % 2 == 0) {
                    message = new Message(idSender, idReciever, messageStr.toString());
                        chatSender.addMessage(message, true, true);
                } else {
                    message = new Message(idReciever, idSender, messageStr.toString());
                    if ( !accountReciever.isBlocked(idSender) ) {
                        chatReceiver.addMessage(message, true, true);
                    }
                }


            }

        }

        System.out.println("Добавлено " + chatCount + " чатов");
        stepThreeFillingOutMedia();
    }

    private void stepThreeFillingOutMedia() {

    }

}
